## Basic Python

### 1.split string

In [1]:
name = "Hey there this is me prathy"
name.split()

['Hey', 'there', 'this', 'is', 'me', 'prathy']

### 2. Formatted string 
- .format is for older version of python
- usage of f("{}") will be more convinient

In [2]:
planet = "Earth"
diameter = 12472
print(f"The diameter of {planet} is {diameter} kilometer")

The diameter of Earth is 12472 kilometer

### 3. Extract "Hello" from nested dictionary

In [3]:
nest_dict = {"k1":[1,2,3,
                   {"tricky":["oh","man","inception",
                              {"target":[1,2,3,"hello"]
                              }]}]
            }

print(nest_dict["k1"][3]["tricky"][3]["target"][3])

hello

## Numpy

### 4.1 create an array of zeros ?

In [4]:
# Import Library
import numpy as np

In [5]:
# Array of 10 zeros 
np_10 = np.zeros(10)
np_10

array([0., 0., 0., 0., 0., 0., 0., 0., 0., 0.])

### 5.Numpy array of all the even integers from 20 to 35

In [6]:
np_evn = np.arange(20,36,2) # start , stop , steps 
np_evn

array([20, 22, 24, 26, 28, 30, 32, 34])

### 6.Create a 3x3 matrix with values ranging from 0 to 8

In [7]:
np_3 = np.arange(0,9).reshape(3,3) # generate number and convert to 3x3 matrix
np_3

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

### 7.Concatenate two array

In [8]:
num_1 = np.array([1,2,3]) # create array 1
num_2 = np.array([4,5,6]) # create array 2
concat = np.concatenate((num_1,num_2),axis=None)
concat

array([1, 2, 3, 4, 5, 6])

## Pandas

### 8. Create a dataframe with 3 rows and 2 columns

In [9]:
# Import Library
import pandas as pd

In [10]:
# create random elements
ran_num = np.random.randint(10,size=(3,2))
df = pd.DataFrame(ran_num,columns=["row1","row2"])
df

   row1  row2
0     6     1
1     7     6
2     1     8

In [11]:
# another convinient method
pd_dict = {
    "col_a":[1,2,3],
    "col_b":[2,5,6]
          }
# Create dataframe
df = pd.DataFrame(pd_dict)
df

   col_a  col_b
0      1      2
1      2      5
2      3      6

In [12]:
name_list = ["Prathy",20],["Durai",20],["Karthick",20],["afridi",19]
df = pd.DataFrame(name_list,columns=["Name","Age"])
df

       Name  Age
0    Prathy   20
1     Durai   20
2  Karthick   20
3    afridi   19

### 9.Generate Series of dates from 1st Jan , 2023 to 10th feb ,2023

In [13]:
import pandas as pd
# calling dataframe constructor 
df = pd.DataFrame()
# create date 
df["time"] = pd.date_range(start="1/1/2023",end="2/10/2023",freq="24H")

# Extract features
df["year"] = df["time"].dt.year
df["month"] = df["time"].dt.month
df["day"] = df["time"].dt.day

In [14]:
df.head()

        time  year  month  day
0 2023-01-01  2023      1    1
1 2023-01-02  2023      1    2
2 2023-01-03  2023      1    3
3 2023-01-04  2023      1    4
4 2023-01-05  2023      1    5

### 10. Create 2D list to DataFrame

In [15]:
lists = [[1,"aaa",22],[2,"bbb",25],[3,"ccc",24]]
df = pd.DataFrame(lists,columns=["col1","col2","col3"])
df

   col1 col2  col3
0     1  aaa    22
1     2  bbb    25
2     3  ccc    24